Tekla.Structures.Model.ClashCheckData
The ClashCheckData class presents information about the detected clash. It is instantiated inside the onClashDetected method.
The objects store the identifiers and type of the clash to be passed on to event subscribers.

Tekla.Structures.Model.ClashCheckData._Identifier1
Private variables

Tekla.Structures.Model.ClashCheckData.Object1
Gets the first clashing object.

Tekla.Structures.Model.ClashCheckData.Object2
Gets the second clashing object.

Tekla.Structures.Model.ClashCheckData.Type
Gets the type of the clash.

Tekla.Structures.Model.ClashCheckData.Overlap
Gets the overlap of the clash. Only applies to clashes of type CLASH_TYPE_CLASH.

Tekla.Structures.Model.ClashCheckData.ToStruct(Tekla.Structures.ModelInternal.dotClash_t)
From ClashCheckData to dotClash_t.
Clash:

Tekla.Structures.Model.ClashCheckData.FromStruct(Tekla.Structures.ModelInternal.dotClash_t)
From dotClash_t to ClashCheckData.
Clash: